In [6]:
# This Jupyter notebook shows you how to perform data cleaning.
# Download property_data.csv into your computer

In [7]:
import pandas as pd
import numpy as np
import os
import math
os.getcwd()

'D:\\PycharmProjects\\MLclass\\W2'

In [8]:
# Load the data in the property_data.csv into the dataframe df
# Use your own path
path="property_data.csv"
df = pd.read_csv(path)

In [9]:
# Now we will look at some basic operations that can be performed on the dataframe

In [10]:
# To see the dimensions of the dataframe
df.shape

(10, 8)

In [11]:
# The output shows 10 rows and 8 columns

In [12]:
# To view the first five rows of the dataframe
df.head()

   PID  ST_NUM    ST_NAME CITY OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0    1   104.0     PUTNAM  NaN            Y            3        1  1000
1    2   197.0  LEXINGTON   NY            N            3      1.5    --
2    3     NaN  LEXINGTON   NY            N          NaN        1   850
3    4   201.0   BERKELEY  NaN           12            1      NaN   700
4    5   203.0   BERKELEY  NaN            Y            3        2  1600

In [13]:
# To print the whloe dataframe
df

,PID,ST_NUM,ST_NAME,CITY,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,1,104.0,PUTNAM,NaN,Y,3,1,1000
1,2,197.0,LEXINGTON,NY,N,3,1.5,--
2,3,NaN,LEXINGTON,NY,N,NaN,1,850
3,4,201.0,BERKELEY,NaN,12,1,NaN,700
4,5,203.0,BERKELEY,NaN,Y,3,2,1600
5,6,207.0,BERKELEY,NaN,Y,NaN,1,800
6,7,NaN,WASHINGTON,WASHINGTON DC,NaN,2,HURLEY,950
7,8,213.0,TREMONT,NaN,Y,1,1,NaN
8,9,215.0,TREMONT,NaN,Y,na,2,1800
9,10,216.0,NaN,NaN,Y,1,NaN,NaN

In [14]:
# We will disply all the null values in the data frme
# The following code will display True when a null value is present
df.isna()

     PID  ST_NUM  ST_NAME   CITY  OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False   False    False   True         False         False     False  False
1  False   False    False  False         False         False     False  False
2  False    True    False  False         False          True     False  False
3  False   False    False   True         False         False      True  False
4  False   False    False   True         False         False     False  False
5  False   False    False   True         False          True     False  False
6  False    True    False  False          True         False     False  False
7  False   False    False   True         False         False     False   True
8  False   False    False   True         False         False     False  False
9  False   False     True   True         False         False      True   True

In [15]:
# If you compare the two last outputs you can see that only NaN is considered as a null value.
# However there are other null values such as "na" at index 8 in NUM_BEDROOMS and "--" at index 1 in SQ_FT
# We have to define that "na" and "--" also means null values

In [16]:
# Making a list of missing value types
missing_values = ["na", "--"]
df = pd.read_csv(path, na_values = missing_values)

In [17]:
# When you print the null values again you can see the difference
df.isna()

     PID  ST_NUM  ST_NAME   CITY  OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False   False    False   True         False         False     False  False
1  False   False    False  False         False         False     False   True
2  False    True    False  False         False          True     False  False
3  False   False    False   True         False         False      True  False
4  False   False    False   True         False         False     False  False
5  False   False    False   True         False          True     False  False
6  False    True    False  False          True         False     False  False
7  False   False    False   True         False         False     False   True
8  False   False    False   True         False          True     False  False
9  False   False     True   True         False         False      True   True

In [18]:
# You might not be able to catch all of these right away. As you work through the data and see other types of missing values, 
# you can add them to the list.

In [19]:
# To see the information about each column
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
PID             10 non-null int64
ST_NUM          8 non-null float64
ST_NAME         9 non-null object
CITY            3 non-null object
OWN_OCCUPIED    9 non-null object
NUM_BEDROOMS    7 non-null float64
NUM_BATH        8 non-null object
SQ_FT           7 non-null float64
dtypes: float64(3), int64(1), object(4)
memory usage: 720.0+ bytes

In [20]:
# Here you can see how many non null values each column has and the data type in each column

In [21]:
# You can notice that CITY has only three non-null values. That is 7 valuse out of 10 are null. 
# In this case we can delete the entire column.

In [22]:
to_drop = ['CITY']
df.drop(to_drop, inplace=True, axis=1)

In [23]:
# Now we will print the head of the dataframe and you can notice that CITY is deleted
df.head()

   PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0    1   104.0     PUTNAM            Y           3.0        1  1000.0
1    2   197.0  LEXINGTON            N           3.0      1.5     NaN
2    3     NaN  LEXINGTON            N           NaN        1   850.0
3    4   201.0   BERKELEY           12           1.0      NaN   700.0
4    5   203.0   BERKELEY            Y           3.0        2  1600.0

In [24]:
# We will count the number of values in each row to check whether there are any rows that we can delete completely 
# because they contain more null values.

In [25]:
df.apply(lambda x: x.count(), axis=1)

0    7
1    6
2    5
3    6
4    7
5    6
6    5
7    6
8    6
9    4
dtype: int64

In [26]:
# lambda is the Function to apply to each column or row. In this case it is count()
# axis : {0 or ‘index’, 1 or ‘columns’}, default 0
# Axis along which the function is applied:
#        0 or ‘index’: apply function to each column.
#       1 or ‘columns’: apply function to each row.

In [27]:
# The first column gives you the index of each row and the second column gives you the number of values in each row.
# Notice that row with index 9 has only 4 values. We can delete that row.

In [28]:
df=df.drop([9])

In [29]:
# Print the data frame
df

   PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0    1   104.0      PUTNAM            Y           3.0        1  1000.0
1    2   197.0   LEXINGTON            N           3.0      1.5     NaN
2    3     NaN   LEXINGTON            N           NaN        1   850.0
3    4   201.0    BERKELEY           12           1.0      NaN   700.0
4    5   203.0    BERKELEY            Y           3.0        2  1600.0
5    6   207.0    BERKELEY            Y           NaN        1   800.0
6    7     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7    8   213.0     TREMONT            Y           1.0        1     NaN
8    9   215.0     TREMONT            Y           NaN        2  1800.0

In [30]:
# You can see that the row with index 9 has been deleted.

In [31]:
# The following will help you in finding null values

In [32]:
# To check if there are any null values in the dataframe.
# The output is True if there are any null values
df.isnull().values.any()

True

In [33]:
# To count the number of null values in the dataframe.
# The output will be the number of null values in the dataframe.
df.isnull().sum().sum()

9

In [34]:
# To count the number of null values in each column.
# The output will be the number of null values in each column.
df.isnull().sum()

PID             0
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    1
NUM_BEDROOMS    3
NUM_BATH        1
SQ_FT           2
dtype: int64

In [35]:
# Now we will take column by column and replace the null values by meaningful data.

In [36]:
# First lets consider "ST_NUM". There are two null values. We will replace them by 125.
# The fillna will fill the "ST_NUM" column with 125 when it has a null value
df['ST_NUM'].fillna(125, inplace=True)

In [37]:
# Print "ST_NUM"
df['ST_NUM']

0    104.0
1    197.0
2    125.0
3    201.0
4    203.0
5    207.0
6    125.0
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [38]:
# The next column with null values is "OWN_OCCUPIED".
df['OWN_OCCUPIED']

0      Y
1      N
2      N
3     12
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

In [39]:
# You can see a 12 at index 3 and a null value at index 6. The value here should be either "Y" or "N".
# We will check whether 12 is taken as null
df['OWN_OCCUPIED'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [40]:
# You can see that 12 is not considered as null. So we will convert it into null.
# There are several approaches to do this. Our approach is
    #   1) Loop through the OWN_OCCUPIED column
    #   2) Try and turn the entry into an integer
    #   3) If the entry can be changed into an integer, enter a missing value
    #   4) If the number can’t be an integer, we know it’s a string, so keep going

In [41]:
# Detecting numbers
cnt=0
for row in df['OWN_OCCUPIED']:
    try:
        int(row)
        df.loc[cnt, 'OWN_OCCUPIED']=np.nan
    except ValueError:
        pass
    cnt+=1

In [42]:
# In the code we’re looping through each entry in the “Owner Occupied” column. To try and change the entry to an integer, 
# we’re using int(row).

# If the value can be changed to an integer, we change the entry to a missing value using Numpy’s np.nan.

# On the other hand, if it can’t be changed to an integer, we pass and keep going.

# You’ll notice that I used try and except ValueError. This is called exception handling, and we use this to handle errors.

# If we were to try and change an entry into an integer and it couldn’t be changed, then a ValueError would be returned, 
# and the code would stop. To deal with this, we use exception handling to recognize these errors, and keep going.

# Another important bit of the code is the .loc method. This is the preferred Pandas method for modifying entries in place. 
# For more info on this you can check out the Pandas documentation.

In [43]:
# When you print the null values in the "OWN_OCCUPIED" you can see that index 3 has turn into null
df['OWN_OCCUPIED'].isnull()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [44]:
df['OWN_OCCUPIED']

0      Y
1      N
2      N
3    NaN
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

In [45]:
# Now we can replace the null values by "Y" or "N"
df['OWN_OCCUPIED'].fillna('Y', inplace=True)
df['OWN_OCCUPIED']

0    Y
1    N
2    N
3    Y
4    Y
5    Y
6    Y
7    Y
8    Y
Name: OWN_OCCUPIED, dtype: object

In [46]:
# Similarly clean the data in the "NUM_BEDROOMS", "NUM_BATH" and "SQ_FT" columns
# "NUM_BEDROOMS" and "NUM_BATH" should be integers
# Null values in "SQ_FT" should be filled by the median of "SQ_FT"
# Save the resultant dataframe as property_data1.csv

In [47]:
for coloum in ['NUM_BEDROOMS','NUM_BATH']:
    cnt=0
    for row in df[coloum]:
        try:
            #print(row)
            df.loc[cnt, coloum]=int(row)
        except ValueError:
            #print("fail")
            df.loc[cnt, coloum]=1
            pass
        cnt+=1

In [48]:
df['NUM_BEDROOMS']=df['NUM_BEDROOMS'].astype(np.int64)
df['NUM_BATH']=df['NUM_BATH'].astype(np.int64)

In [49]:
for coloum in ['SQ_FT']:
    cnt=0
    for row in df[coloum]:
        #print(row)
        if math.isnan(df.loc[cnt, coloum]):
            df.loc[cnt,coloum]=950
        cnt+=1

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9 entries, 0 to 8
Data columns (total 7 columns):
PID             9 non-null int64
ST_NUM          9 non-null float64
ST_NAME         9 non-null object
OWN_OCCUPIED    9 non-null object
NUM_BEDROOMS    9 non-null int64
NUM_BATH        9 non-null int64
SQ_FT           9 non-null float64
dtypes: float64(2), int64(3), object(2)
memory usage: 896.0+ bytes

In [51]:
df

   PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0    1   104.0      PUTNAM            Y             3         1  1000.0
1    2   197.0   LEXINGTON            N             3         1   950.0
2    3   125.0   LEXINGTON            N             1         1   850.0
3    4   201.0    BERKELEY            Y             1         1   700.0
4    5   203.0    BERKELEY            Y             3         2  1600.0
5    6   207.0    BERKELEY            Y             1         1   800.0
6    7   125.0  WASHINGTON            Y             2         1   950.0
7    8   213.0     TREMONT            Y             1         1   950.0
8    9   215.0     TREMONT            Y             1         2  1800.0

In [52]:
path1="property_data1.csv"
df.to_csv(path1)
df1=pd.read_csv(path1)
df1

,Unnamed: 0,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,0,1,104.0,PUTNAM,Y,3,1,1000.0
1,1,2,197.0,LEXINGTON,N,3,1,950.0
2,2,3,125.0,LEXINGTON,N,1,1,850.0
3,3,4,201.0,BERKELEY,Y,1,1,700.0
4,4,5,203.0,BERKELEY,Y,3,2,1600.0
5,5,6,207.0,BERKELEY,Y,1,1,800.0
6,6,7,125.0,WASHINGTON,Y,2,1,950.0
7,7,8,213.0,TREMONT,Y,1,1,950.0
8,8,9,215.0,TREMONT,Y,1,2,1800.0

TypeError: 'module' object is not callable